Repository: VitoSpritz/cinemaNight
Catalog: lib/l10n/app_*.arb
Languages: it

source: Confirm logout
it: Conferma logout

source: Are you sure you want to quit?
it: Sei sicuro di voler uscire?

source: Yes
it: Si

source: Welcome,
it: Benvenuto, {data}

# singelWelcome
source: Welcome
it: Benvenuto

# goToHome
source: Go to the home page
it: Vai alla pagina principale

# currentUserString
source: User: {email}
it: Utente: {email}

source: unknown
it: sconosciuto

source: Invalid credential
it: Credenziali non valide

source: Invalid email
it: Email non valida

# authenticationError
source: Authentication error: {errorCode}
it: Errore di autenticazione: {errorCode}

# loginButton
source: Login
it: Accedi

# notRegisteredPress
source: Not registered yet? Press
it: Non hai un account? Premi

source: here
it: qui

source: Required field
it: Campo obbligatorio

# insertaValidAge
source: Insert valid age
it: Inserire un'età valida

source: Email already in use
it: Email già in uso

# error
source: Error: {errorMessage}
it: Errore: {errorMessage}

source: Sign up
it: Crea un account

source: First and last name
it: Nome e cognome

source: Age
it: Età

source: Already have an account? Press
it: Hai già un account? Premi

source: Password is required
it: La password è necessaria

# passwordMinimalRequirements
source: Password must contain at least 8 characters, 1 capital letter and 1 number
it: La password deve contenere almeno 8 caratteri, 1 lettera maiuscole e 1 numero

source: Email is required
it: L'indirizzo email è necessario

source: Insert a valid email
it: Inserire una email valida

source: Reviews
it: Recensioni

source: Chats
it: Gruppi

# requestApiLanguage
source: en-EN
it: it-ITA

# noReviews
source: No reviews available
it: Nessuna recensione disponibile

# addReview
source: Add a review
it: Aggiungi una recensione

source: Title
it: Titolo

source: Search
it: Cerca

source: Results:
it: Risultati:

source: Review
it: Recensione

source: Save
it: Salva

# searchAMovie
source: Search a movie or a TV show
it: Cerca un film o una serie TV

# changeMovie
source: Change selected movie
it: Cambia il film selezionato

# updateButton
source: Submit update
it: Aggiorna

# deleteReviewButton
source: Delete
it: Elimina

# deleteReviewDialog
source: You want to delete this review?
it: Vuoi davvero eliminare questa recensione?

# firstAiredLabel
source: First aired: {date}
it: Trasmesso per la prima volta: {date}

# releasedLabel
source: Released {date}
it: Prima visione {date}

# insertAReview
source: Insert a new review
it: Inserisci una nuova recensione

# exitWithoutSavingDialong
source: Changes will be lost if you quit
it: Perderai i cambiamenti se esci

# sureYouWantToQuit
source: You want to quit?
it: Sei sicuro di voler uscire?

# reviewInfoPageTitle
source: Review Details
it: Dettaglio recensione

# confirmLabel
source: Confirm
it: Conferma

# cancelLabel
source: Cancel
it: Annulla

# attentionLabel
source: Attention!
it: Attenzione!

source: Show less
it: Nascondi

source: Show more
it: Mostra altro

source: Summary
it: Riassunto

source: User Data
it: Dati Utente

source: Favourite Genre:
it: Genere Preferito:

source: Favourite Movie
it: Film Preferito

source: Profile Updated!
it: Profilo Aggiornato!

source: Unsaved Changes!
it: Modifiche non salvate

source: No chat available
it: Nessuna chat disponibile

# openedBadgeLabel
source: Opened
it: Aperto

# dateSelectionLabel
source: Selecting a date
it: Scegliendo una data

# filmSelectionLabel
source: Selecting a film
it: Scegliendo un film

# closedBadgeLabel
source: Closed
it: Chiuso

# inactiveBadgeLabel
source: Inactive
it: Inattivo

source: Search a film
it: Ricerca un film

source: Search a chat
it: Ricerca una chat

# userListModalNoUserSubscribed
source: No subscribed user
it: Nessun utente iscritto

# reviewCardLoadingError
source: Error loading {name}
it: Errore nel caricamento {name}

# filmPickerModalYourGrade
source: Your grade
it: Il tuo voto:

# filmPickerModalReviewAlreadyExisting
source: Your review is already existing!
it: La recensione è già esistente!

# customMovieDisplayTitleNotAvailable
source: Title not available
it: Titolo non disponibile

# customMovieDisplay
source: ‚≠ê {data}
it: ⭐ {data}

# customDropdownMenuSelectAGenre
source: Select a genre
it: Seleziona un genere

# createChatDialogNameError
source: Insert a valid name
it: Inserire un nome valido

# createChatDialogDateError
source: Insert a valid date
it: Inserire una data valida

# createChatDialogPasswordError
source: The password is not compliant
it: La password non rispecchia i canoni minimi

# insetPasswordDialogInsertPassword
source: Insert a passowrd
it: Inserisci una password

# insetPasswordDialogWrongPassword
source: Wrong password
it: Password errata

# chatRecapTitle
source: Chat has ended! HEre's the results
it: La chat è terminata! Ecco i risultati

# chatRecapChosenDate
source: Date chosen for the night: {data}
it: Data scelta per la serata: {data}

# chatRecapChosenFilm
source: Film chosen for the night: {data}
it: Film scelto per la serata: {data}

# chatListItemMainTitle
source: Restricted access
it: Accesso riservato

# chatListItemSubtitle
source: Insert password to join
it: Inserire la password per entrare

# chatListItemWrongPassword
source: Wrong password, try again.
it: Password errata. Riprova.

# chatListItemDeleteChatMessage
source: You really want to delete the chat {data}?
it: Sei dicuro di voler eliminare questa chat {data}?

# chatListItemClosesAt
source: Closes at:
it: Chiude il:

# filmSuggestionModalSuggetFilm
source: Suggest a film
it: Proponi un film

# filmSuggestionModalLoadingMoreError
source: Error loading more: {data}
it: Errore nel caricare altri: {data}

# filmSuggestionModalError
source: Error: {data}
it: Errore: {data}

# homeReviewInstructionFirst
source: Get started with CineChat, leave a review or create a group!
it: Inizia subito ad utilizzare CineChat, lascia una tua recensione oppure crea un gruppo!

# homeReviewInstructionSecond
source: Create a review
it: Crea una recensione

# homeReviewInstructionThird
source: By clicking the button
it: Cliccando il tasto

# homeReviewInstructionFourth
source: you can write a review of a film, rate it and share your own review with your friends
it: potrai scrivere recensione sui film che hai visto, dargli un voto e condividerli con i tuoi amici.

# homeChatInstructionFirst
source: Chat with your friends
it: Parla con i tuoi amici

# homeChatInstructionSecond
source: If you want to chat and organize a chat night, click
it: Se invece vuoi vuoi parlare con i tuoi amici e organizzare serate a tema cinema, clicca

# homeChatInstructionThird
source: in order to create a chat, choose up to five possible dates and then suggest up to a film for each. The most liked one will be chosen at the end of the time limit.
it: per poter creare una chat, scegliere da una a cinque possibili date e proponi al massimo un film. I più votati saranno scelti alla chiusura della camera.
